Documents/Посещение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Посещение</Name>
    <Posting>Allow</Posting>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Занятие</Name>
      <ValueType><v8:Type>cfg:DocumentRef.Занятие</v8:Type><v8:TypeQualifiers><v8:Type>cfg:DocumentRef.Занятие</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Преподаватель</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаПосещения</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Комментарий</Name>
      <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    </Attribute>

    <TabularSection>
      <Name>Участники</Name>
      <Attributes>
        <Attribute>
          <Name>Клиент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>СтатусПосещения</Name>
          <ValueType><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыПосещения</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>СписатьЗанятие</Name>
          <ValueType><v8:Type>xs:boolean</v8:Type><v8:TypeQualifiers><v8:Type>xs:boolean</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
        <Attribute>
          <Name>Комментарий</Name>
          <ValueType><v8:Type>xs:string</v8:Type></ValueType>
        </Attribute>
        <Attribute>
          <Name>Абонемент</Name>
          <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
        </Attribute>
      </Attributes>
    </TabularSection>

  </ChildObjects>
</MetaDataObject>

AccumulationRegisters/Посещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>Посещения</Name>
    <RegisterType>Turnover</RegisterType>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Dimension>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Dimension>
      <Name>Преподаватель</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Преподаватели</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Dimension>
      <Name>Направление</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Направления</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Направления</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Resource>
      <Name>Присутствовал</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Resource>

    <Resource>
      <Name>Отсутствовал</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Resource>

    <Resource>
      <Name>Списано</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Resource>

  </ChildObjects>
</MetaDataObject>

AccumulationRegisters/ОстаткиАбонементов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>ОстаткиАбонементов</Name>
    <RegisterType>Balance</RegisterType>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Dimension>
      <Name>АбонементКлиента</Name>
      <ValueType><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.АбонементыКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Dimension>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Dimension>

    <Resource>
      <Name>КоличествоЗанятий</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Resource>

  </ChildObjects>
</MetaDataObject>

Enums/СтатусыЗанятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыЗанятия</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Запланировано</Name>
    </Value>
    <Value>
      <Name>Подтверждено</Name>
    </Value>
    <Value>
      <Name>Проведено</Name>
    </Value>
    <Value>
      <Name>Отменено</Name>
    </Value>
    <Value>
      <Name>Перенесено</Name>
    </Value>
    <Value>
      <Name>НеСостоялось</Name>
    </Value>
  </Properties>
</MetaDataObject>

Enums/СтатусыПосещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>
  <Properties>
    <Name>СтатусыПосещения</Name>
    <ValueType><v8:Type>xs:string</v8:Type></ValueType>
    <Value>
      <Name>Присутствовал</Name>
    </Value>
    <Value>
      <Name>Отсутствовал</Name>
    </Value>
    <Value>
      <Name>ОтменилЗаранее</Name>
    </Value>
    <Value>
      <Name>ОтменилПоздно</Name>
    </Value>
    <Value>
      <Name>УважительнаяПричина</Name>
    </Value>
  </Properties>
</MetaDataObject>

Catalogs/АбонементыКлиента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject>

  <Properties>
    <Name>АбонементыКлиента</Name>
    <Hierarchical>false</Hierarchical>
    <WriteMode>Exchange</WriteMode>
  </Properties>
  <ChildObjects>
    <Attribute>
      <Name>Клиент</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Клиенты</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Клиенты</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ВидАбонемента</Name>
      <ValueType><v8:Type>cfg:CatalogRef.Абонементы</v8:Type><v8:TypeQualifiers><v8:Type>cfg:CatalogRef.Абонементы</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаПокупки</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>DateTime</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаНачалаДействия</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ДатаОкончания</Name>
      <ValueType><v8:Type>xs:dateTime</v8:Type><v8:TypeQualifiers><v8:Type>xs:dateTime</v8:Type><v8:DateQualifiers><v8:DateFractions>Date</v8:DateFractions></v8:DateQualifiers></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>КоличествоЗанятий</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Использовано</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>15</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Заморожено</Name>
      <ValueType><v8:Type>xs:decimal</v8:Type><v8:Qualifiers><v8:Type>xs:decimal</v8:Type><v8:NumberQualifiers><v8:Precision>10</v8:Precision><v8:Scale>0</v8:Scale></v8:NumberQualifiers></v8:Qualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>Статус</Name>
      <ValueType><v8:Type>cfg:EnumRef.СтатусыАбонементаКлиента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:EnumRef.СтатусыАбонементаКлиента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

    <Attribute>
      <Name>ПроданоПоДокументу</Name>
      <ValueType><v8:Type>cfg:DocumentRef.ПродажаАбонемента</v8:Type><v8:TypeQualifiers><v8:Type>cfg:DocumentRef.ПродажаАбонемента</v8:Type></v8:TypeQualifiers></ValueType>
    </Attribute>

  </ChildObjects>
</MetaDataObject>

Documents/Посещение/Ext/ObjectModule.bsl
// Модуль документа Посещение

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ЗанятиеОбъект = Занятие.ПолучитьОбъект();
	ЗанятиеОбъект.Статус = Перечисления.СтатусыЗанятия.Проведено;
	ЗанятиеОбъект.Записать();

	// Списание занятий с абонементов и регистрация посещаемости
	НаборЗаписейПосещения = РегистрыНакопления.Посещения.СоздатьНаборЗаписей();
	НаборЗаписейПосещения.Отбор.Регистратор.Установить(Ссылка);
	НаборЗаписейПосещения.Записать();

	// Движения списания по остаткам абонементов
	ДвиженияОстатки = Новый Массив;

	Для Каждого СтрокаУчастников ИЗ Участники Цикл
		// Обновляем статус посещения в занятии
		Для Каждого УчастникЗанятия ИЗ ЗанятиеОбъект.Участники Цикл
			Если УчастникЗанятия.Клиент = СтрокаУчастников.Клиент Тогда
				УчастникЗанятия.СтатусПосещения = СтрокаУчастников.СтатусПосещения;
				Прервать;
			КонецЕсли;
		КонецЦикла;

		Движение = НаборЗаписейПосещения.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Клиент = СтрокаУчастников.Клиент;
		Движение.Преподаватель = Преподаватель;
		Движение.Направление = ЗанятиеОбъект.Направление;

		Если СтрокаУчастников.СтатусПосещения = Перечисления.СтатусыПосещения.Присутствовал Тогда
			Движение.Присутствовал = 1;
		ИначеЕсли СтрокаУчастников.СтатусПосещения = Перечисления.СтатусыПосещения.Отсутствовал
			ИЛИ СтрокаУчастников.СтатусПосещения = Перечисления.СтатусыПосещения.ОтменилПоздно Тогда
			Движение.Отсутствовал = 1;
		КонецЕсли;

		// Списание занятия с абонемента (движение Расход по регистру ОстаткиАбонементов)
		Если СтрокаУчастников.СписатьЗанятие И Не ПустоеЗначение(СтрокаУчастников.Абонемент) Тогда
			Если РаботаСОстаткамиАбонементов.ОстатокЗанятийПоАбонементу(СтрокаУчастников.Абонемент) <= 0 Тогда
				ВызватьИсключение "Невозможно провести посещение: абонемент клиента закончился.";
			КонецЕсли;

			ДвижениеОстатки = Новый Структура("ВидДвижения, АбонементКлиента, КоличествоЗанятий");
			ДвижениеОстатки.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеОстатки.АбонементКлиента = СтрокаУчастников.Абонемент;
			ДвижениеОстатки.КоличествоЗанятий = 1;
			ДвиженияОстатки.Добавить(ДвижениеОстатки);

			Движение.Списано = 1;
		КонецЕсли;
	КонецЦикла;

	НаборЗаписейПосещения.Записать();

	Если ДвиженияОстатки.Количество() > 0 Тогда
		РаботаСОстаткамиАбонементов.ЗаписатьДвиженияОстатки(Ссылка, Дата, ДвиженияОстатки);
		// Обновление денормализованных полей абонементов
		СписокАбонементов = Новый Массив;
		Для Каждого ДвижениеОстатки ИЗ ДвиженияОстатки Цикл
			Если СписокАбонементов.Найти(ДвижениеОстатки.АбонементКлиента) = Неопределено Тогда
				СписокАбонементов.Добавить(ДвижениеОстатки.АбонементКлиента);
			КонецЕсли;
		КонецЦикла;
		Для Каждого АбонементКлиента ИЗ СписокАбонементов Цикл
			РаботаСОстаткамиАбонементов.ОбновитьИспользованоПоАбонементу(АбонементКлиента);
		КонецЦикла;
	КонецЕсли;

	ЗанятиеОбъект.Записать();
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ЗанятиеОбъект = Занятие.ПолучитьОбъект();
	ЗанятиеОбъект.Статус = Перечисления.СтатусыЗанятия.Запланировано;
	Для Каждого УчастникЗанятия ИЗ ЗанятиеОбъект.Участники Цикл
		УчастникЗанятия.СтатусПосещения = Перечисления.СтатусыПосещения.Отсутствовал;
	КонецЦикла;
	ЗанятиеОбъект.Записать();

	// Возврат списанных занятий на баланс
	ОтборОстатки = Новый Структура("Регистратор", Ссылка);
	ЗаписиОстатки = РегистрыНакопления.ОстаткиАбонементов.СоздатьНаборЗаписей();
	ЗаписиОстатки.Отбор.Регистратор.Установить(Ссылка);
	ЗаписиОстатки.Прочитать();
	Для Каждого Запись ИЗ ЗаписиОстатки Цикл
		Если Запись.ВидДвижения = ВидДвиженияНакопления.Расход Тогда
			РаботаСОстаткамиАбонементов.ОбновитьИспользованоПоАбонементу(Запись.АбонементКлиента);
		КонецЕсли;
	КонецЦикла;
	ОтборОстатки.Вставить("ВидДвижения", ВидДвиженияНакопления.Расход);
	РаботаСОстаткамиАбонементов.ОбновитьИспользованоПоАбонементу(Справочники.АбонементыКлиента.ПустаяСсылка());
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПустоеЗначение(Занятие) Тогда
		Сообщить("Не указано занятие");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры
